NRDaza/Ejemplos_ADC/ADC_LM35.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "LCD.h"
#include "ADC.h"
#include "LM35_in_aliases.h"
#include "LM35_in.h"
#include "RS_aliases.h"
#include "RS.h"
#include "E_aliases.h"
#include "E.h"
#include "D4_aliases.h"
#include "D4.h"
#include "D5_aliases.h"
#include "D5.h"
#include "D6_aliases.h"
#include "D6.h"
#include "D7_aliases.h"
#include "D7.h"
#include "Opamp.h"
#include "LM35_in2_aliases.h"
#include "LM35_in2.h"
#include "Opamp_1.h"
#include "Mux.h"
#include "LCD_Cntl_Port.h"
#include "ADC_AMux.h"
#include "ADC_Ext_CP_Clk.h"
#include "ADC_IRQ.h"
#include "ADC_theACLK.h"
#include "cy_em_eeprom.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"

/*[]*/

